In [24]:
import pandas as pd
import numpy as np
import sys
sys.path.append('../')
from utils import load_df, get_df_info

from sklearn.linear_model import LogisticRegression

In [2]:
path = './data/train.csv'
df = load_df(path)

891 rows and 12 columns read from ./data/train.csv

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.shape

(891, 12)

In [5]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
df = df.set_index('PassengerId')

In [7]:
get_df_info(df)

--------------------missing values--------------------
Age 177
Cabin 687
Embarked 2
--------------------numeric columns--------------------
['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']
--------------------string columns--------------------
['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']
--------------------statistics--------------------
         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
df.loc[2,'Age']

38.0

In [9]:
df.iloc[2, 2]

'Heikkinen, Miss. Laina'

In [10]:
df.loc[(df.Survived==1), ['Name','Sex']]

                                                          Name     Sex
PassengerId
2            Cumings, Mrs. John Bradley (Florence Briggs Th...  female
3                                       Heikkinen, Miss. Laina  female
4                 Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
9            Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
10                         Nasser, Mrs. Nicholas (Adele Achem)  female
...                                                        ...     ...
876                           Najib, Miss. Adele Kiamie "Jane"  female
880              Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female
881               Shelley, Mrs. William (Imanita Parrish Hall)  female
888                               Graham, Miss. Margaret Edith  female
890                                      Behr, Mr. Karl Howell    male

[342 rows x 2 columns]

In [11]:
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [12]:
df_survived = df.loc[(df.Survived==1), ['Name','Sex']]

In [13]:
df_survived.Sex.value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [14]:
df.Cabin.isnull().sum()

687

In [15]:
# how many female s/d, how many male s/d
df.groupby(['Sex']).size()

Sex
female    314
male      577
dtype: int64

In [16]:
df.groupby(['Sex', 'Survived']).size()

Sex     Survived
female  0            81
        1           233
male    0           468
        1           109
dtype: int64

In [17]:
df.corr()

          Survived    Pclass       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.369226  0.083081  0.018443 -0.549500
Age      -0.077221 -0.369226  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.096067  0.159651  0.216225  1.000000

In [20]:
df.Sex.apply(lambda x: 0 if x=='male' else 1)

PassengerId
1      0
2      1
3      1
4      1
5      0
      ..
887    0
888    1
889    1
890    0
891    0
Name: Sex, Length: 891, dtype: int64

In [22]:
df.Sex = np.where((df.Sex=='male'), 0, 1)

In [23]:
df.corr()

          Survived    Pclass       Sex       Age     SibSp     Parch      Fare
Survived  1.000000 -0.338481  0.543351 -0.077221 -0.035322  0.081629  0.257307
Pclass   -0.338481  1.000000 -0.131900 -0.369226  0.083081  0.018443 -0.549500
Sex       0.543351 -0.131900  1.000000 -0.093254  0.114631  0.245489  0.182333
Age      -0.077221 -0.369226 -0.093254  1.000000 -0.308247 -0.189119  0.096067
SibSp    -0.035322  0.083081  0.114631 -0.308247  1.000000  0.414838  0.159651
Parch     0.081629  0.018443  0.245489 -0.189119  0.414838  1.000000  0.216225
Fare      0.257307 -0.549500  0.182333  0.096067  0.159651  0.216225  1.000000

In [34]:
df.loc[df.Age.isnull(), 'Age'] = df.Age.mean()

In [35]:
X = df['Pclass Sex Age SibSp Parch Fare'.split()].values

In [37]:
y = df.Survived.values

In [39]:
lr = LogisticRegression()
lr.fit(X, y)
y_pred = lr.predict(X)
(y_pred == y).sum()/len(y)

0.797979797979798